In [9]:
import pandas as pd

In [10]:
df = pd.read_csv("company_revenue.csv")
df.head()

   Year  Quarter        Company  Revenue
0  2023        1      AlphaTech   500000
1  2023        1  BetaSolutions   350000
2  2023        1      GammaCorp   720000
3  2023        2      AlphaTech   520000
4  2023        2  BetaSolutions   340000

In [11]:
df.pivot_table(index="Year", columns="Quarter", values="Revenue", aggfunc="sum")

Quarter        1        2        3        4
Year
2023     1570000  1610000  1680000  1770000

In [12]:
df_weather = pd.read_csv("weather_data.csv")
df_weather

         Day  Temperature_CityA  Temperature_CityB
0     Monday                 22                 19
1    Tuesday                 24                 20
2  Wednesday                 25                 21
3   Thursday                 20                 18
4     Friday                 23                 19
5   Saturday                 26                 22
6     Sunday                 27                 23

In [13]:
df_weather = pd.melt(df_weather, id_vars=["Day"], var_name="City", value_name="Temperature")
df_weather

          Day               City  Temperature
0      Monday  Temperature_CityA           22
1     Tuesday  Temperature_CityA           24
2   Wednesday  Temperature_CityA           25
3    Thursday  Temperature_CityA           20
4      Friday  Temperature_CityA           23
5    Saturday  Temperature_CityA           26
6      Sunday  Temperature_CityA           27
7      Monday  Temperature_CityB           19
8     Tuesday  Temperature_CityB           20
9   Wednesday  Temperature_CityB           21
10   Thursday  Temperature_CityB           18
11     Friday  Temperature_CityB           19
12   Saturday  Temperature_CityB           22
13     Sunday  Temperature_CityB           23

In [14]:
df_weather[df_weather["City"] == "Temperature_CityA"]

         Day               City  Temperature
0     Monday  Temperature_CityA           22
1    Tuesday  Temperature_CityA           24
2  Wednesday  Temperature_CityA           25
3   Thursday  Temperature_CityA           20
4     Friday  Temperature_CityA           23
5   Saturday  Temperature_CityA           26
6     Sunday  Temperature_CityA           27

In [15]:
df_employee = pd.read_csv("employee_data.csv")
df_employee

,Name,Age,Occupation,Nationality,Salary_USD,Years_Experience
0,John Smith,29,Software Engineer,USA,95000,5
1,Fatima Ali,26,Data Scientist,Pakistan,35000,3
2,Wei Chen,34,AI Researcher,China,105000,8
3,Elena Gomez,31,UX Designer,Spain,45000,6
4,Liam O'Connor,24,Python Developer,Ireland,52000,2
5,Aarav Gupta,40,Project Manager,India,85000,15
6,Sophie Dubois,28,Marketing Lead,France,58000,4

In [16]:
pd.crosstab(df_employee.Occupation, df_employee.Nationality, margins=True)

Nationality        China  France  India  Ireland  Pakistan  Spain  USA  All
Occupation
AI Researcher          1       0      0        0         0      0    0    1
Data Scientist         0       0      0        0         1      0    0    1
Marketing Lead         0       1      0        0         0      0    0    1
Project Manager        0       0      1        0         0      0    0    1
Python Developer       0       0      0        1         0      0    0    1
Software Engineer      0       0      0        0         0      0    1    1
UX Designer            0       0      0        0         0      1    0    1
All                    1       1      1        1         1      1    1    7